app/controllers/meetings_controller.rb

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @meeting = Meeting.find params[:id]

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @meeting = Meeting.find params[:id]

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "meetings" ("title", "description", "start_time", "end_time", "created_at", "updated_at", "tutor", "user_id", "tutor_id", "meeting_location", "meeting_online_link", "student_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tutor = Tutor.find(params[:tutor_id])
    @meeting = @tutor.meetings.build(meeting_params)

    @meeting.user_id = current_user.id
    @meeting.tutor_id = @tutor.id

    respond_to do |format|
      if @tutor.save

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "meetings" SET "start_time" = ?, "updated_at" = ? WHERE "meetings"."id" = ?  [["start_time", "2022-12-16 23:36:00"], ["updated_at", "2022-12-14 22:37:00.298480"], ["id", 3]]
---
  def update
    @meeting = Meeting.find params[:id]
    @meeting.user_id = current_user.id
    @meeting.tutor_id = @tutor.id

    respond_to do |format|
      if @meeting.update(meeting_params)

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_meeting
      @meeting = Meeting.find(params[:id])

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tutor
      @tutor = Tutor.find(params[:tutor_id])