app/controllers/tutors_controller.rb

SELECT "tutors".* FROM "tutors"
---
  def index
    @tutors = Tutor.all

SELECT "meetings".* FROM "meetings" WHERE "meetings"."start_time" BETWEEN ? AND ?  [["start_time", "2022-11-27 05:00:00"], ["start_time", "2023-01-01 04:59:59.999999"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."tutor_id" = ? ORDER BY created_at DESC  [["tutor_id", 1]]
---
  def show
      @meetings = Meeting.where(
        start_time: Time.now.beginning_of_month.beginning_of_week..Time.now.end_of_month.end_of_week
      )
      puts(@meetings)

    @reviews = Review.where(tutor_id: @tutor.id).order("created_at DESC")

INSERT INTO "tutors" ("first_name", "last_name", "email", "phone", "bio", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tutor = current_user.tutors.build(tutor_params)

    respond_to do |format|
      if @tutor.save

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tutor
      @tutor = Tutor.find(params[:id])